[
  {
    "title": "Full Stack Engineer",
    "company": "Realworks",
    "dates": "OCT 2022 - PRESENT",
    "description": [
      "Worked on a CRM for real estate agents, specifically in the new constructions sector, within an Agile scrum team, contributing to 100% continuous improvement and deployment.",
      "Contributed to the complete migration of the product to newer technologies.",
      "Joined the Security Chapter of the company."
    ],
    "technologies": ["Java", "Spring Boot", "React", "MariaDB"]
  },
  {
    "title": "Full Stack Engineer",
    "company": "SIBS International",
    "dates": "SEPT 2020 - SEPT 2022",
    "description": [
      "Designed and implemented several new features in a set of different applications for the biggest company responsible for the payments sector in Portugal.",
      "Contributed to the complete migration of the the old authorization service to Keycloak.",
      "Built multiple frontend applications from old technologies to newer ones."
    ],
    "technologies": [
      "Java",
      "Jakarta EE",
      "Wildfly",
      "React",
      "Angular",
      "Keycloak",
      "MySQL"
    ]
  },
  {
    "title": "Software Engineer",
    "company": "Accenture / NOS",
    "dates": "APR 2019 - AUG 2020",
    "description": [
      "Designed and implemented multiple features in a CRM for one of the biggest companies in the telecommunications and broadcasting sector in Portugal.",
      "Conducted multiple presentations to the client."
    ],
    "technologies": ["Java", "Spring Boot", "React", "Oracle SQL"]
  },
  {
    "title": "Software Engineer",
    "company": "Fujitsu",
    "dates": "NOV 2018 - MAR 2019",
    "description": [
      "Worked individually on designing an orchestrator to automate the software installation process when requested by internal teams, eliminating the need for humans to process validations and perform tasks.",
      "Implemented and documented the whole database architecture together with all the scripts needed to communicate between third party APIs and install software in the users machines."
    ],
    "technologies": ["C#", "Scripting", "SQL Server"]
  },
  {
    "title": "Software Engineer",
    "company": "Accenture / EDP",
    "dates": "APR 2018 - OCT 2018",
    "description": [
      "Joined a team responsible for the billing sector in a Customer Care & Billing application for the biggest energy company based in Portugal.",
      "Resolved multiple issues reported by the client through a SLA contract.",
      "Implemented several software enhancements in the application."
    ],
    "technologies": ["Java", "ServiceNow"]
  }
]
