[
  {
    "title": "Full Stack Engineer",
    "company": "Realworks",
    "dates": "OCT 2022 - PRESENT",
    "description": [
      "Involved in a full-scale migration from a legacy monolith to a Spring Boot + React microservices architecture, improving team autonomy and accelerating feature delivery and scalability.",
      "Built and optimized REST and GraphQL APIs for frontend integration, reducing response times by 30–50%.",
      "Consistently delivered high-impact features across multiple large-scale epics, while proactively improving application stability by resolving production issues and reducing incident rates by 40-60%.",
      "Developed multiple Grafana dashboards tailored to different features, enabling the dev team to detect issues faster and providing the Product Owner with visibility into new features and user behavior metrics."
    ],
    "technologies": [
      "Java",
      "Spring Boot",
      "React",
      "MariaDB",
      "Docker",
      "K8s",
      "Grafana"
    ]
  },
  {
    "title": "Full Stack Engineer",
    "company": "SIBS International",
    "dates": "SEPT 2020 - SEPT 2022",
    "description": [
      "Developed features for an online payment gateway using Java and Spring Boot, processing thousands of transactions per minute.",
      "Led the migration of the legacy authorization service to Keycloak, enhancing security and access control.",
      "Fully modernized a Card Management app for banks, migrating from AngularJS and J2EE to Angular and Spring Boot."
    ],
    "technologies": [
      "Java",
      "Jakarta EE",
      "Wildfly",
      "React",
      "Angular",
      "Keycloak",
      "MySQL"
    ]
  },
  {
    "title": "Software Engineer",
    "company": "Accenture / NOS",
    "dates": "APR 2019 - AUG 2020",
    "description": [
      "Led the full development lifecycle of new features in a CRM application built in Spring MVC — from design and estimation to implementation, testing, and maintenance.",
      "Ensured high code quality with comprehensive unit and integration tests.",
      "Delivered technical demos and functional presentations to align teams and stakeholders."
    ],
    "technologies": ["Java", "Spring Boot", "React", "Oracle SQL"]
  },
  {
    "title": "Software Engineer",
    "company": "Fujitsu",
    "dates": "NOV 2018 - MAR 2019",
    "description": [
      "Independently designed and built an orchestrator using C# scripts to automate internal software installation processes, consuming APIs for validation and task execution.",
      "Delivered a fully implemented and documented codebase and database schema, ensuring long-term maintainability and smooth system operations."
    ],
    "technologies": ["C#", "Scripting", "SQL Server"]
  },
  {
    "title": "Software Engineer",
    "company": "Accenture / EDP",
    "dates": "APR 2018 - OCT 2018",
    "description": [
      "Played a key role in implementing multiple software enhancements  within a Customer Care & Billing application for the billing sector.",
      "Effectively addressed and resolved various client-reported issues in adherence to SLA contracts"
    ],
    "technologies": ["Java", "ServiceNow"]
  }
]
