[
  {
    "title": "Full Stack Engineer",
    "company": "Realworks",
    "dates": "OCT 2022 - PRESENT",
    "description": [
      "Collaborated within an Agile Scrum team to develop a CRM  solution tailored for real estate agents, specializing in the new constructions sector.",
      "Involved in the full-scale migration of the product, encompassing both Frontend and Backend components, to state-of-the-art technologies, optimizing performance and user experience.",
      "Joined the Security Chapter of the company."
    ],
    "technologies": ["Java", "Spring Boot", "React", "MariaDB"]
  },
  {
    "title": "Full Stack Engineer",
    "company": "SIBS International",
    "dates": "SEPT 2020 - SEPT 2022",
    "description": [
      "Executed the successful implementation of multiple features across diverse applications for Portugal's leading payment sector entity.",
      "Played a pivotal role in orchestrating themigration of the antiquated authorization service to Keycloak, ensuring enhanced security.",
      "Involved in the migration of legacy products to cutting-edge technologies."
    ],
    "technologies": [
      "Java",
      "Jakarta EE",
      "Wildfly",
      "React",
      "Angular",
      "Keycloak",
      "MySQL"
    ]
  },
  {
    "title": "Software Engineer",
    "company": "Accenture / NOS",
    "dates": "APR 2019 - AUG 2020",
    "description": [
      "Led end-to-end processes, including design, estimation, implementation, testing, and ongoing maintenance, for novel features in a CRM application.",
      "Ensured robust code quality and functionality through the meticulous development and execution of unit and integration tests.",
      "Conducted functional and technical presentations to showcase the developed features, ensuring a complete understanding across teams and stakeholders."
    ],
    "technologies": ["Java", "Spring Boot", "React", "Oracle SQL"]
  },
  {
    "title": "Software Engineer",
    "company": "Fujitsu",
    "dates": "NOV 2018 - MAR 2019",
    "description": [
      "Independently designed and implemented an orchestrator to automate software installation processes from internal team, eliminating the need for manual validation and task execution.",
      "Executed the complete implementation and documentation of the database architecture and entire codebase, ensuring a robust and well-documented foundation for efficient system operation and maintenance."
    ],
    "technologies": ["C#", "Scripting", "SQL Server"]
  },
  {
    "title": "Software Engineer",
    "company": "Accenture / EDP",
    "dates": "APR 2018 - OCT 2018",
    "description": [
      "Played a key role in implementing multiple software enhancements  within a Customer Care & Billing application for the billing sector.",
      "Effectively addressed and resolved various client-reported issues in adherence to SLA contracts"
    ],
    "technologies": ["Java", "ServiceNow"]
  }
]
